{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"function": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwwAAAB8AABkAQAbZAIAGFMpA05nAAAAAADgb0BnAAAAAAAA\n4D+pACkB2gF4cgEAAAByAQAAAPofPGlweXRob24taW5wdXQtMTctYmYyZWYxNmVjNTgxPtoIPGxh\nbWJkYT4HAAAAcwAAAAA=\n", null, null], "arguments": {}, "batch_input_shape": [null, 66, 200, 3], "dtype": "float32", "trainable": true, "output_shape": null, "name": "lambda_1", "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [2, 2], "filters": 24, "name": "conv2d_1", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [2, 2], "filters": 36, "name": "conv2d_2", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [2, 2], "filters": 48, "name": "conv2d_3", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "filters": 64, "name": "conv2d_4", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "strides": [1, 1], "filters": 64, "name": "conv2d_5", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 100, "activation": "linear", "trainable": true, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 50, "activation": "linear", "trainable": true, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 10, "activation": "linear", "trainable": true, "name": "dense_3", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 1, "activation": "linear", "trainable": true, "name": "dense_4", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}}}]}